HW1b/app/controllers/main_controller.rb

SELECT * FROM "agents"
SELECT * FROM "settings"
INSERT INTO "agents" ("name", "vote", "created_at", "updated_at") VALUES('alice', NULL, '2011-08-28 00:07:58', '2011-08-28 00:07:58')
---
  def member
    if !Settings.instance.voting_started and params[:agent] and !params[:agent].empty? and !Agent.exists?(params[:agent])
      Agent.create!(:name => params[:agent])

SELECT * FROM "agents" WHERE ("agents"."name" = 'alice') LIMIT 1
SELECT * FROM "agents"
SELECT * FROM "settings"
SELECT * FROM "candidates"
INSERT INTO "candidates" ("name") VALUES('')
UPDATE "agents" SET "updated_at" = '2011-08-28 00:09:04', "vote" = 'Kennedy' WHERE "id" = 1
UPDATE "settings" SET "updated_at" = '2011-08-28 04:32:00', "victor_declared" = 't' WHERE "id" = 1
---
  def vote
    agent, candidate = Agent.find_by_name(params[:agent]), params[:vote]
    if !Settings.instance.victor_declared and agent and candidate and !candidate.empty? and !agent.voted_already?
      if !Candidate.exists?(candidate)
        Candidate.create!(:name => candidate)
      end
      agent.update_attribute(:vote, candidate)